jmzeeman/stm32f4xx-hal/src/spi.rs
    SPI6:
        SCK: [
            NoSck,
            PG13<Alternate<AF5>>
        ]
        MISO: [
            NoMiso,
            PG12<Alternate<AF5>>
        ]
        MOSI: [
            NoMosi,
            PG14<Alternate<AF5>>
        ]
}

#[cfg(any(feature = "stm32f446"))]
pins! {
    SPI2:
        SCK: [PA9<Alternate<AF5>>]
        MISO: []
        MOSI: [PC1<Alternate<AF7>>]

    SPI3:
        SCK: []
        MISO: []
        MOSI: [
            PB0<Alternate<AF7>>,
            PB2<Alternate<AF7>>,
            PD0<Alternate<AF6>>
        ]

    SPI4:
        SCK: [PG11<Alternate<AF6>>]
        MISO: [
            PG12<Alternate<AF6>>,
            PD0<Alternate<AF5>>
        ]
        MOSI: [PG13<Alternate<AF6>>]
}

#[cfg(any(feature = "stm32f469", feature = "stm32f479"))]
pins! {
    SPI2:
        SCK: [PA9<Alternate<AF5>>]
        MISO: []
        MOSI: [PC1<Alternate<AF5>>]
}

/// Interrupt events
pub enum Event {
    /// New data has been received
    Rxne,
    /// Data can be sent
    Txe,
    /// An error occurred
    Error,
}

#[derive(Debug)]
pub struct Spi<SPI, PINS> {
    spi: SPI,
    pins: PINS,
}

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl<PINS> Spi<SPI1, PINS> {
    pub fn spi1(spi: SPI1, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks) -> Self
    where
        PINS: Pins<SPI1>,
    {
        spi1_ext(spi, pins, mode, freq, clocks, SpiInterface::FullDuplex);
    }
    pub fn spi1_ext(spi: SPI1, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks, interface: SpiInterface) -> Self
    where
        PINS: Pins<SPI1>,
    {
        unsafe {
            const EN_BIT: u8 = 12;
            // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
            let rcc = &(*RCC::ptr());

            // Enable clock.
            bb::set(&rcc.apb2enr, EN_BIT);
        }

        Spi { spi, pins }.init(mode, freq, clocks.pclk2(), interface)
    }
}

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl<PINS> Spi<SPI2, PINS> {
    pub fn spi2(spi: SPI2, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks) -> Self
    where
        PINS: Pins<SPI2>,
    {
        spi2_ext(spi, pins, mode, freq, clocks, SpiInterface::FullDuplex);
    }
    pub fn spi2_ext(spi: SPI2, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks, interface: SpiInterface) -> Self
    where
        PINS: Pins<SPI2>,
    {
        unsafe {
            const EN_BIT: u8 = 14;
            // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
            let rcc = &(*RCC::ptr());

            // Enable clock.
            bb::set(&rcc.apb1enr, EN_BIT);
        }

        Spi { spi, pins }.init(mode, freq, clocks.pclk1(), interface)
    }
}

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f415",
    feature = "stm32f417",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl<PINS> Spi<SPI3, PINS> {
    pub fn spi3(spi: SPI3, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks) -> Self
    where
        PINS: Pins<SPI3>,
    {
        spi3_ext(spi, pins, mode, freq, clocks, SpiInterface::FullDuplex);
    }
    pub fn spi3_ext(spi: SPI3, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks, interface: SpiInterface) -> Self
    where
        PINS: Pins<SPI3>,
    {
        unsafe {
            const EN_BIT: u8 = 15;
            // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
            let rcc = &(*RCC::ptr());

            // Enable clock.
            bb::set(&rcc.apb1enr, EN_BIT);
        }

        Spi { spi, pins }.init(mode, freq, clocks.pclk1(), interface)
    }
}

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl<PINS> Spi<SPI4, PINS> {
    pub fn spi4(spi: SPI4, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks) -> Self
    where
        PINS: Pins<SPI4>,
    {
        spi4_ext(spi, pins, mode, freq, clocks, SpiInterface::FullDuplex);
    }
    pub fn spi4_ext(spi: SPI4, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks, interface: SpiInterface) -> Self
    where
        PINS: Pins<SPI4>,
    {
        unsafe {
            const EN_BIT: u8 = 13;
            // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
            let rcc = &(*RCC::ptr());

            // Enable clock.
            bb::set(&rcc.apb2enr, EN_BIT);
        }

        Spi { spi, pins }.init(mode, freq, clocks.pclk2(), interface)
    }
}

#[cfg(any(
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl<PINS> Spi<SPI5, PINS> {
    pub fn spi5(spi: SPI5, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks) -> Self
    where
        PINS: Pins<SPI5>,
    {
        spi5_ext(spi, pins, mode, freq, clocks, SpiInterface::FullDuplex);
    }
    pub fn spi5_ext(spi: SPI5, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks, interface: SpiInterface) -> Self
    where
        PINS: Pins<SPI5>,
    {
        unsafe {
            const EN_BIT: u8 = 20;
            // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
            let rcc = &(*RCC::ptr());

            // Enable clock.
            bb::set(&rcc.apb2enr, EN_BIT);
        }

        Spi { spi, pins }.init(mode, freq, clocks.pclk2(), interface)
    }
}

#[cfg(any(
    feature = "stm32f427",
    feature = "stm32f429",
    feature = "stm32f437",
    feature = "stm32f439",
    feature = "stm32f469",
    feature = "stm32f479"
))]
impl<PINS> Spi<SPI6, PINS> {
    pub fn spi6(spi: SPI6, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks) -> Self
    where
        PINS: Pins<SPI6>,
    {
        spi5_ext(spi, pins, mode, freq, clocks, SpiInterface::FullDuplex);
    }
    pub fn spi5_ext(spi: SPI6, pins: PINS, mode: Mode, freq: Hertz, clocks: Clocks, interface: SpiInterface) -> Self
    where
        PINS: Pins<SPI6>,
    {
        unsafe {
            const EN_BIT: u8 = 21;
            // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
            let rcc = &(*RCC::ptr());

            // Enable clock.
            bb::set(&rcc.apb2enr, EN_BIT);
        }

        Spi { spi, pins }.init(mode, freq, clocks.pclk2(), interface)
    }
}

impl<SPI, PINS> Spi<SPI, PINS>
where
    SPI: Deref<Target = spi1::RegisterBlock>,
{
    pub fn init(self, mode: Mode, freq: Hertz, clock: Hertz, interface: SpiInterface) -> Self {
        // disable SS output
        self.spi.cr2.write(|w| w.ssoe().clear_bit());
        
        let br = match clock.0 / freq.0 {
            0 => unreachable!(),
            1..=2 => 0b000,
            3..=5 => 0b001,
            6..=11 => 0b010,
            12..=23 => 0b011,
            24..=47 => 0b100,
            48..=95 => 0b101,
            96..=191 => 0b110,
            _ => 0b111,
        };

        // mstr: master configuration
        // lsbfirst: MSB first
        // ssm: enable software slave management (NSS pin free for other uses)
        // ssi: set nss high = master mode
        // dff: 8 bit frames
        // bidimode: 2-line unidirectional
        // spe: enable the SPI bus
        self.spi.cr1.write(|w| {
            w.cpha()
                .bit(mode.phase == Phase::CaptureOnSecondTransition)
                .cpol()
                .bit(mode.polarity == Polarity::IdleHigh)
                .mstr()
                .set_bit()
                .br()
                .bits(br)
                .lsbfirst()
                .clear_bit()
                .ssm()
                .set_bit()
                .ssi()
                .set_bit()
                .rxonly()
                .bit(interface == SpiInterface::RxOnly)
                .dff()
                .clear_bit()
                .bidimode()
                .bit(interface == SpiInterface::BiDirectional)
                .spe()
                .set_bit()
        });

        self
    }

    /// Enable interrupts for the given `event`:
    ///  - Received data ready to be read (RXNE)
    ///  - Transmit data register empty (TXE)
    ///  - Transfer error
    pub fn listen(&mut self, event: Event) {
        match event {
            Event::Rxne => self.spi.cr2.modify(|_, w| w.rxneie().set_bit()),
            Event::Txe => self.spi.cr2.modify(|_, w| w.txeie().set_bit()),
            Event::Error => self.spi.cr2.modify(|_, w| w.errie().set_bit()),
        }
    }

